public class Main {
    public static void main(String[] args) {
        int amount = 7530;
        int percent = 20;
        int bonus = amount / percent;
        System.out.println("Your bonus is: "+ bonus +" miles");


        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}